Repository: GreihMurray/SoftwareDevProject2021
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ga

source: Welcome to the CSCI 5030 - Software Development Spellchecker
ga: Fáilte chuig an CSCI 5030 - Litritheoir Forbartha Bogearraí

source: This is a spellchecker that will allow you, the user, to input text and receive a quick, accurate spell check so you can be assured that all of your writing is free of errors!
ga: Seiceálaí litrithe é seo a ligfidh duit, don úsáideoir, téacs a ionchur agus seiceáil litrithe tapa, cruinn a fháil ionas gur féidir leat a bheith cinnte go bhfuil do chuid scríbhneoireachta go léir saor ó earráidí!

source: How do I use it?
ga: Conas a úsáidim é?

source: To use this tool, click your choice of language from the menu, and then type or paste the text you want to check into the textbox below. When complete, press the spell check button to receive a list of words that may need corrections, or an output indicating your successful spellings.
ga: Chun an uirlis seo a úsáid, cliceáil do rogha teanga ón roghchlár, agus ansin clóscríobh nó greamaigh an téacs a theastaíonn uait a sheiceáil isteach sa bhosca téacs thíos. Nuair a bheidh sé críochnaithe, brúigh an cnaipe seiceála litrithe chun liosta focal a fháil a bhféadfadh ceartúcháin a bheith ag teastáil uathu, nó aschur a léiríonn do litriú rathúil.

source: About
ga: Faoi

source: Spellchecker
ga: Litritheoir

source: Site Language
ga: Teanga Suíomh Gréasáin

source: English
ga: Béarla

source: Irish
ga: Gaeilge

source: Spellchecking System: Click on the language selection tool to open the menu of supported languages.
ga: Córas Seiceála Litrithe: Cliceáil ar an uirlis roghnaithe teanga chun roghchlár na dteangacha tacaithe a oscailt.

source: Language Select
ga: Roghnaigh Teanga

source: Current language:
ga: Teanga reatha:

source: Languages:
ga: Teangacha:

source: Input Text:
ga: Téacs Ionchuir:

source: Recommendations:
ga: Moltaí:

source: Spell Check
ga: Seiceáil Litrithe
